-- Node ID: 149
-- Name: Часть_2
-- Type: sub_query
-- Parent: ВТ_ДанныеКонтрагентов
-- OwnInTables: __QM_7F33EC02D3D44C7685E22B073D2AD092__,, __QM_63B42773C99941F6A0D47885E9D53699__,, __QM_C36254C20ECF499EA92D73257D9DE62D__,, __QM_DDBE139238894053A128D7879A66A2D2__,, NULL,, __QM_4EF0BE7B401D4BB9A891B2E72EC822D3__,, __QM_079FB82AB5094B218A7DD72D71BC1014__

ВЫБРАТЬ
	"00000",
	"АМ0",
	"00000",
	"КН0000",
	NULL,
	"000-000-00000",
	"Акционеры миноритарии",
	"??????",
	NULL,
	NULL,
	"??????",
	"??????",
	"??????",
	NULL,
	ЗНАЧЕНИЕ(Перечисление.епс_НеперсонифицируемыеАкционеры.АкционерыМиноритарии),
	"Акционеры миноритарии"