-- Node ID: 292
-- Name: ВТ_ДополнительноВыкупнаяВкдачикуНетСПТ
-- Type: temp_query
-- Parent: null
-- OwnInTables: ВТ_ПЕНСИОННЫЕСЧЕТА_СВОЙСТВА, ВТ_НЕТРАНЗИТНЫЕВИДЫНАЧАЛОКОНЕЦ, ВТ_СУММЫ, ВТ_РАСЧЕТНАЯДАТАВС

ВЫБРАТЬ


	ВТ_ПенсионныеСчета_Свойства.ПенсионныйДоговор.ПенсионныйСчет КАК СчетДоговора,
    СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_Суммы.ОстатокИсх, 0) * ISNULL(ВТ_РасчетнаяДатаВС.КоэффСреднеВзвешенный, 0) КАК ЧИСЛО(25,2)) 
    - ВЫБОР ВТ_ПенсионныеСчета_Свойства.НаличиеСПТ
		КОГДА ИСТИНА
			ТОГДА
				ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_Суммы.ОбязательстваПоВыкупнойСумме, 0) * ISNULL(ВТ_РасчетнаяДатаВС.КоэффСреднеВзвешенный, 0) КАК ЧИСЛО(25,2)) 
        ИНАЧЕ 0
    КОНЕЦ) КАК СуммаОбязательствПоВСНаКонец34Вкладчику 
ПОМЕСТИТЬ ВТ_ДополнительноВыкупнаяВкдачикуНетСПТ
ИЗ
	ВТ_ПенсионныеСчета_Свойства КАК ВТ_ПенсионныеСчета_Свойства
	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НеТранзитныеВидыНачалоКонец КАК ВТ_НеТранзитныеВидыНачалоКонец
	ПО ВТ_ПенсионныеСчета_Свойства.ПенсионныйСчет = ВТ_НеТранзитныеВидыНачалоКонец.ПенсионныйСчет
		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Суммы КАК ВТ_Суммы
		ПО ВТ_ПенсионныеСчета_Свойства.ПенсионныйСчет = ВТ_Суммы.ПенсионныйСчет
		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасчетнаяДатаВС КАК ВТ_РасчетнаяДатаВС
		ПО ВТ_ПенсионныеСчета_Свойства.ПенсионныйСчет = ВТ_РасчетнаяДатаВС.ПенсионныйСчет
СГРУППИРОВАТЬ ПО 
	ВТ_ПенсионныеСчета_Свойства.ПенсионныйДоговор.ПенсионныйСчет