-- Node ID: 64
-- Name: Часть_1
-- Type: sub_query
-- Parent: ВТ_ВидыОбязательств
-- OwnInTables: ВТ_ВИДОБЯЗАТЕЛЬСТВНАЧАЛО.ВИДОБЯЗАТЕЛЬСТВВХОД, ВТ_ВИДОБЯЗАТЕЛЬСТВНАЧАЛО.ДАТАОПРЕДЕЛЕНИЯОБЯЗАТЕЛЬСТВ, ВТ_ВИДОБЯЗАТЕЛЬСТВНАЧАЛО

ВЫБРАТЬ
	ВТ_ВидОбязательствНачало.ПенсионныйСчет КАК ПенсионныйСчет,
	ВТ_ВидОбязательствНачало.ВидОбязательствВход КАК ВидОбязательств,
	ВТ_ВидОбязательствНачало.ДатаОпределенияОбязательств КАК ДатаОпределенияОбязательств
ПОМЕСТИТЬ ВТ_ВидыОбязательств
ИЗ
	ВТ_ВидОбязательствНачало КАК ВТ_ВидОбязательствНачало