-- Node ID: 73
-- Name: Часть_2
-- Type: sub_query
-- Parent: ВТ_СторнированныеСуммыТранзитныеВиды
-- OwnInTables: ВТ_ТРАНЗИТНЫЕВИДЫНАЧАЛОКОНЕЦ.ВИДОБЯЗАТЕЛЬСТВ, ВТ_ТРАНЗИТНЫЕВИДЫНАЧАЛОКОНЕЦ.ДАТАОПРЕДЕЛЕНИЯОБЯЗАТЕЛЬСТВ, ВТ_ТРАНЗИТНЫЕВИДЫНАЧАЛОКОНЕЦ.ДАТАОКОНЧАНИЯОБЯЗАТЕЛЬСТВ, 0,, СУММА, ВТ_ТРАНЗИТНЫЕВИДЫНАЧАЛОКОНЕЦ, РЕГИСТРНАКОПЛЕНИЯ.УП_ПРОЧИЕНАЧИСЛЕНИЯ, ВТ_ДОКУМЕНТЫСТОРНО

ВЫБРАТЬ
	ВТ_ТранзитныеВидыНачалоКонец.ПенсионныйСчет КАК ПенсионныйСчет,
	ВТ_ТранзитныеВидыНачалоКонец.ВидОбязательств КАК ВидОбязательств,
	ВТ_ТранзитныеВидыНачалоКонец.ДатаОпределенияОбязательств КАК ДатаОпределенияОбязательств,
	ВТ_ТранзитныеВидыНачалоКонец.ДатаОкончанияОбязательств КАК ДатаОкончанияОбязательств,
	0,
	СУММА(ВЫБОР
		КОГДА уп_ПрочиеНачисления.ТипВыплаты = ЗНАЧЕНИЕ(Перечисление.уп_ТипыВыплат.ВыплатыРасторженцам)
			ТОГДА уп_ПрочиеНачисления.Сумма
		ИНАЧЕ 0
	КОНЕЦ),
	СУММА(ВЫБОР
		КОГДА уп_ПрочиеНачисления.ТипВыплаты = ЗНАЧЕНИЕ(Перечисление.уп_ТипыВыплат.ВыплатыНаследникам)
			ТОГДА уп_ПрочиеНачисления.Сумма
		ИНАЧЕ 0
	КОНЕЦ)
ИЗ
	ВТ_ТранзитныеВидыНачалоКонец КАК ВТ_ТранзитныеВидыНачалоКонец	
	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_ПрочиеНачисления КАК уп_ПрочиеНачисления
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДокументыСторно КАК ВТ_ДокументыСторно
		ПО уп_ПрочиеНачисления.Регистратор = ВТ_ДокументыСторно.ДокументСторно
	ПО уп_ПрочиеНачисления.НомерСчета = ВТ_ТранзитныеВидыНачалоКонец.ПенсионныйСчет
			И уп_ПрочиеНачисления.Период МЕЖДУ ВЫБОР 
												КОГДА ВТ_ТранзитныеВидыНачалоКонец.ДатаОпределенияОбязательств < &НачалоПериода
													ТОГДА &НачалоПериода
												ИНАЧЕ ВТ_ТранзитныеВидыНачалоКонец.ДатаОпределенияОбязательств
											КОНЕЦ
												И 
											ВЫБОР 
												КОГДА ВТ_ТранзитныеВидыНачалоКонец.ДатаОкончанияОбязательств ЕСТЬ NULL
													ТОГДА &КонецПериода
												ИНАЧЕ ВТ_ТранзитныеВидыНачалоКонец.ДатаОкончанияОбязательств
											КОНЕЦ	
ГДЕ
	уп_ПрочиеНачисления.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	И уп_ПрочиеНачисления.Активность
СГРУППИРОВАТЬ ПО
	ВТ_ТранзитныеВидыНачалоКонец.ПенсионныйСчет,
	ВТ_ТранзитныеВидыНачалоКонец.ВидОбязательств,
	ВТ_ТранзитныеВидыНачалоКонец.ДатаОпределенияОбязательств,
	ВТ_ТранзитныеВидыНачалоКонец.ДатаОкончанияОбязательств