-- Node ID: 196
-- Name: ВТ_СуммыКоэффициентыВС_предв
-- Type: temp_query
-- Parent: null
-- OwnInTables: ВТ_СУММЫ_ПР_ДЛЯВС, ВТ_ПЕНСИОННЫЕДОГОВОРЫ_СВОЙСТВА, РЕГИСТРСВЕДЕНИЙ.УП_КОЭФФИЦИЕНТВЫКУПНОЙСТОИМОСТИ.СРЕЗПОСЛЕДНИХ

ВЫБРАТЬ
	ВТ_Суммы_ПР_дляВС.ПенсионныйСчет КАК ПенсионныйСчет,
	ВТ_Суммы_ПР_дляВС.ШаблонДоговора КАК ШаблонДоговора,
	ВТ_Суммы_ПР_дляВС.Схема КАК Схема,
	ВТ_Суммы_ПР_дляВС.ТипРезерва КАК ТипРезерва,
	ВТ_Суммы_ПР_дляВС.ТипСуммы КАК ТипСуммы,
	ВТ_Суммы_ПР_дляВС.ОстатокИсх КАК ОстатокИсх,
	ВТ_Суммы_ПР_дляВС.ПриоритетРасчетаВС КАК ПриоритетРасчетаВС,
	
	ВЫБОР ВТ_ПенсионныеДоговоры_Свойства.ПериодОхлажденияИстек
		КОГДА ИСТИНА
			ТОГДА ISNULL(уп_КоэффициентВыкупнойСтоимостиСрезПоследних.Коэффициент, 0)
				+ ЕСТЬNULL(ДоговорКоэфДляРасчетаВыкупныхСумм.Коэффициент, 0) 
				+ ЕСТЬNULL(ШаблонКоэфДляРасчетаВыкупныхСумм.Коэффициент, 0) 
				+ ЕСТЬNULL(СхемаКоэфДляРасчетаВыкупныхСумм.Коэффициент, 0)
		ИНАЧЕ
			ВЫБОР 
				КОГДА ISNULL(уп_КоэффициентВыкупнойСтоимостиСрезПоследних.Коэффициент, 0)
					+ ЕСТЬNULL(ДоговорКоэфДляРасчетаВыкупныхСумм.Коэффициент, 0) 
					+ ЕСТЬNULL(ШаблонКоэфДляРасчетаВыкупныхСумм.Коэффициент, 0) 
					+ ЕСТЬNULL(СхемаКоэфДляРасчетаВыкупныхСумм.Коэффициент, 0) > 0
					ТОГДА 1
				ИНАЧЕ 0
			КОНЕЦ
	КОНЕЦ   КАК КоэффициентВС,	




	ISNULL(уп_КоэффициентВыкупнойСтоимостиСрезПоследних.Коэффициент, 0) +
	ISNULL(БудущееДоговорКоэфДляРасчетаВыкупныхСумм.Коэффициент, 0) +
	ISNULL(БудущееШаблонКоэфДляРасчетаВыкупныхСумм.Коэффициент, 0) +
	ISNULL(БудущееСхемаКоэфДляРасчетаВыкупныхСумм.Коэффициент, 0) КАК БудущееКоэффициентВС,
    ISNULL(БудущееДоговорКоэфДляРасчетаВыкупныхСумм.НачалоПериода, 0) +
    ISNULL(БудущееШаблонКоэфДляРасчетаВыкупныхСумм.НачалоПериода, 0) +
    ISNULL(БудущееСхемаКоэфДляРасчетаВыкупныхСумм.НачалоПериода, 0) КАК БудущееНачалоПериода,	
    ВТ_Суммы_ПР_дляВС.Состояние КАК Состояние,
	ВТ_Суммы_ПР_дляВС.СостояниеДляРасчета КАК СостояниеДляРасчета, 
    ВТ_Суммы_ПР_дляВС.КоличествоЛет КАК КоличествоЛет,
    ВТ_Суммы_ПР_дляВС.ПериодРасчетаВС КАК ПериодРасчетаВС
ПОМЕСТИТЬ ВТ_СуммыКоэффициентыВС_предв 
ИЗ 
	ВТ_Суммы_ПР_дляВС КАК ВТ_Суммы_ПР_дляВС 
	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПенсионныеДоговоры_Свойства	КАК ВТ_ПенсионныеДоговоры_Свойства
	ПО ВТ_Суммы_ПР_дляВС.ПенсионныйСчет.Владелец = ВТ_ПенсионныеДоговоры_Свойства.ПенсионныйДоговор
	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_КоэффициентВыкупнойСтоимости.СрезПоследних(&КонецПериода, ) КАК уп_КоэффициентВыкупнойСтоимостиСрезПоследних
	ПО (ВТ_Суммы_ПР_дляВС.ПенсионныйСчет.Владелец  = уп_КоэффициентВыкупнойСтоимостиСрезПоследних.ПенсионныйДоговор
		И ВТ_Суммы_ПР_дляВС.ПриоритетРасчетаВС < 20)
	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			уп_КоэффициентыДляРасчетаВыкупныхСумм.СхемаДоговор КАК СхемаДоговор,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.Состояние КАК Состояние,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ТипРезерва КАК ТипРезерва,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ТипСуммы КАК ТипСуммы,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.НачалоПериода КАК НачалоПериода,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.КонецПериода КАК КонецПериода,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ВидРасторжения КАК ВидРасторжения,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ВариантыРасчета КАК ВариантыРасчета,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.Коэффициент КАК Коэффициент,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ДействияПоОстаткам КАК ДействияПоОстаткам,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ВыплачиватьВНачале КАК ВыплачиватьВНачале,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ПересчитыватьНаДатуСмерти КАК ПересчитыватьНаДатуСмерти
		ИЗ  
			РегистрСведений.уп_КоэффициентыДляРасчетаВыкупныхСумм КАК уп_КоэффициентыДляРасчетаВыкупныхСумм
		ГДЕ
			уп_КоэффициентыДляРасчетаВыкупныхСумм.СхемаДоговор ССЫЛКА Справочник.уп_ПенсионныеДоговоры	
			И уп_КоэффициентыДляРасчетаВыкупныхСумм.ВидРасторжения = ЗНАЧЕНИЕ(Перечисление.уп_ВидыРасторжения.Досрочное)) КАК ДоговорКоэфДляРасчетаВыкупныхСумм
	ПО  ВТ_Суммы_ПР_дляВС.ПриоритетРасчетаВС = 21
		И ВТ_Суммы_ПР_дляВС.ПенсионныйСчет.Владелец = ДоговорКоэфДляРасчетаВыкупныхСумм.СхемаДоговор
		И ВТ_Суммы_ПР_дляВС.СостояниеДляРасчета = ДоговорКоэфДляРасчетаВыкупныхСумм.Состояние
		И ВТ_Суммы_ПР_дляВС.ТипРезерва = ДоговорКоэфДляРасчетаВыкупныхСумм.ТипРезерва
		И ВТ_Суммы_ПР_дляВС.ТипСуммы = ДоговорКоэфДляРасчетаВыкупныхСумм.ТипСуммы
		И ДоговорКоэфДляРасчетаВыкупныхСумм.НачалоПериода <= ВТ_Суммы_ПР_дляВС.КоличествоЛет 
		И ДоговорКоэфДляРасчетаВыкупныхСумм.КонецПериода >= ВТ_Суммы_ПР_дляВС.КоличествоЛет 
	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			уп_КоэффициентыДляРасчетаВыкупныхСумм.СхемаДоговор КАК СхемаДоговор,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.Состояние КАК Состояние,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ТипРезерва КАК ТипРезерва,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ТипСуммы КАК ТипСуммы,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.НачалоПериода КАК НачалоПериода,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.КонецПериода КАК КонецПериода,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ВидРасторжения КАК ВидРасторжения,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ВариантыРасчета КАК ВариантыРасчета,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.Коэффициент КАК Коэффициент,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ДействияПоОстаткам КАК ДействияПоОстаткам,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ВыплачиватьВНачале КАК ВыплачиватьВНачале,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ПересчитыватьНаДатуСмерти КАК ПересчитыватьНаДатуСмерти
		ИЗ
			РегистрСведений.уп_КоэффициентыДляРасчетаВыкупныхСумм КАК уп_КоэффициентыДляРасчетаВыкупныхСумм
		ГДЕ
			уп_КоэффициентыДляРасчетаВыкупныхСумм.СхемаДоговор ССЫЛКА Справочник.уп_ШаблоныДоговоров	
			И уп_КоэффициентыДляРасчетаВыкупныхСумм.ВидРасторжения = ЗНАЧЕНИЕ(Перечисление.уп_ВидыРасторжения.Досрочное)) КАК ШаблонКоэфДляРасчетаВыкупныхСумм
	ПО ВТ_Суммы_ПР_дляВС.ПриоритетРасчетаВС = 22
		И ВТ_Суммы_ПР_дляВС.ШаблонДоговора = ШаблонКоэфДляРасчетаВыкупныхСумм.СхемаДоговор
		И ВТ_Суммы_ПР_дляВС.СостояниеДляРасчета = ШаблонКоэфДляРасчетаВыкупныхСумм.Состояние
		И ВТ_Суммы_ПР_дляВС.ТипРезерва = ШаблонКоэфДляРасчетаВыкупныхСумм.ТипРезерва
		И ВТ_Суммы_ПР_дляВС.ТипСуммы = ШаблонКоэфДляРасчетаВыкупныхСумм.ТипСуммы
		И ШаблонКоэфДляРасчетаВыкупныхСумм.НачалоПериода <= ВТ_Суммы_ПР_дляВС.КоличествоЛет 
		И ШаблонКоэфДляРасчетаВыкупныхСумм.КонецПериода >= ВТ_Суммы_ПР_дляВС.КоличествоЛет 
	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			уп_КоэффициентыДляРасчетаВыкупныхСумм.СхемаДоговор КАК СхемаДоговор,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.Состояние КАК Состояние,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ТипРезерва КАК ТипРезерва,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ТипСуммы КАК ТипСуммы,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.НачалоПериода КАК НачалоПериода,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.КонецПериода КАК КонецПериода,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ВидРасторжения КАК ВидРасторжения,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ВариантыРасчета КАК ВариантыРасчета,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.Коэффициент КАК Коэффициент,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ДействияПоОстаткам КАК ДействияПоОстаткам,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ВыплачиватьВНачале КАК ВыплачиватьВНачале,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ПересчитыватьНаДатуСмерти КАК ПересчитыватьНаДатуСмерти
		ИЗ
			РегистрСведений.уп_КоэффициентыДляРасчетаВыкупныхСумм КАК уп_КоэффициентыДляРасчетаВыкупныхСумм
		ГДЕ
			уп_КоэффициентыДляРасчетаВыкупныхСумм.СхемаДоговор ССЫЛКА Справочник.уп_ПенсионныеСхемы	
			И уп_КоэффициентыДляРасчетаВыкупныхСумм.ВидРасторжения = ЗНАЧЕНИЕ(Перечисление.уп_ВидыРасторжения.Досрочное)) КАК СхемаКоэфДляРасчетаВыкупныхСумм
	ПО ВТ_Суммы_ПР_дляВС.ПриоритетРасчетаВС = 23
		И ВТ_Суммы_ПР_дляВС.Схема = СхемаКоэфДляРасчетаВыкупныхСумм.СхемаДоговор
		И ВТ_Суммы_ПР_дляВС.СостояниеДляРасчета = СхемаКоэфДляРасчетаВыкупныхСумм.Состояние
		И ВТ_Суммы_ПР_дляВС.ТипРезерва = СхемаКоэфДляРасчетаВыкупныхСумм.ТипРезерва
		И ВТ_Суммы_ПР_дляВС.ТипСуммы = СхемаКоэфДляРасчетаВыкупныхСумм.ТипСуммы
		И СхемаКоэфДляРасчетаВыкупныхСумм.НачалоПериода <= ВТ_Суммы_ПР_дляВС.КоличествоЛет 
		И СхемаКоэфДляРасчетаВыкупныхСумм.КонецПериода >= ВТ_Суммы_ПР_дляВС.КоличествоЛет


	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			уп_КоэффициентыДляРасчетаВыкупныхСумм.СхемаДоговор КАК СхемаДоговор,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.Состояние КАК Состояние,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ТипРезерва КАК ТипРезерва,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ТипСуммы КАК ТипСуммы,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.НачалоПериода КАК НачалоПериода,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.КонецПериода КАК КонецПериода,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ВидРасторжения КАК ВидРасторжения,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.Коэффициент КАК Коэффициент
		ИЗ  
			РегистрСведений.уп_КоэффициентыДляРасчетаВыкупныхСумм КАК уп_КоэффициентыДляРасчетаВыкупныхСумм
		ГДЕ
			уп_КоэффициентыДляРасчетаВыкупныхСумм.СхемаДоговор ССЫЛКА Справочник.уп_ПенсионныеДоговоры	
			И уп_КоэффициентыДляРасчетаВыкупныхСумм.ВидРасторжения = ЗНАЧЕНИЕ(Перечисление.уп_ВидыРасторжения.Досрочное)
			И уп_КоэффициентыДляРасчетаВыкупныхСумм.ВидРасторжения >= 1) 													КАК БудущееДоговорКоэфДляРасчетаВыкупныхСумм
	ПО  ВТ_Суммы_ПР_дляВС.ПриоритетРасчетаВС = 21
		И ВТ_Суммы_ПР_дляВС.ПенсионныйСчет.Владелец = БудущееДоговорКоэфДляРасчетаВыкупныхСумм.СхемаДоговор
		И ВТ_Суммы_ПР_дляВС.СостояниеДляРасчета = БудущееДоговорКоэфДляРасчетаВыкупныхСумм.Состояние
		И ВТ_Суммы_ПР_дляВС.ТипРезерва = БудущееДоговорКоэфДляРасчетаВыкупныхСумм.ТипРезерва
		И ВТ_Суммы_ПР_дляВС.ТипСуммы = БудущееДоговорКоэфДляРасчетаВыкупныхСумм.ТипСуммы
		И (БудущееДоговорКоэфДляРасчетаВыкупныхСумм.НачалоПериода > ВТ_Суммы_ПР_дляВС.КоличествоЛет
			ИЛИ БудущееДоговорКоэфДляРасчетаВыкупныхСумм.КонецПериода > ВТ_Суммы_ПР_дляВС.КоличествоЛет)
	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			уп_КоэффициентыДляРасчетаВыкупныхСумм.СхемаДоговор КАК СхемаДоговор,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.Состояние КАК Состояние,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ТипРезерва КАК ТипРезерва,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ТипСуммы КАК ТипСуммы,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.НачалоПериода КАК НачалоПериода,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.КонецПериода КАК КонецПериода,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ВидРасторжения КАК ВидРасторжения,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.Коэффициент КАК Коэффициент
		ИЗ  
			РегистрСведений.уп_КоэффициентыДляРасчетаВыкупныхСумм КАК уп_КоэффициентыДляРасчетаВыкупныхСумм
		ГДЕ
			уп_КоэффициентыДляРасчетаВыкупныхСумм.СхемаДоговор ССЫЛКА Справочник.уп_ШаблоныДоговоров	
			И уп_КоэффициентыДляРасчетаВыкупныхСумм.ВидРасторжения = ЗНАЧЕНИЕ(Перечисление.уп_ВидыРасторжения.Досрочное)
			И уп_КоэффициентыДляРасчетаВыкупныхСумм.ВидРасторжения >= 1) 													КАК БудущееШаблонКоэфДляРасчетаВыкупныхСумм
	ПО ВТ_Суммы_ПР_дляВС.ПриоритетРасчетаВС = 22
		И ВТ_Суммы_ПР_дляВС.ШаблонДоговора = БудущееШаблонКоэфДляРасчетаВыкупныхСумм.СхемаДоговор
		И ВТ_Суммы_ПР_дляВС.СостояниеДляРасчета = БудущееШаблонКоэфДляРасчетаВыкупныхСумм.Состояние
		И ВТ_Суммы_ПР_дляВС.ТипРезерва = БудущееШаблонКоэфДляРасчетаВыкупныхСумм.ТипРезерва
		И ВТ_Суммы_ПР_дляВС.ТипСуммы = БудущееШаблонКоэфДляРасчетаВыкупныхСумм.ТипСуммы
		И (БудущееШаблонКоэфДляРасчетаВыкупныхСумм.НачалоПериода > ВТ_Суммы_ПР_дляВС.КоличествоЛет
			ИЛИ БудущееШаблонКоэфДляРасчетаВыкупныхСумм.КонецПериода > ВТ_Суммы_ПР_дляВС.КоличествоЛет)
	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			уп_КоэффициентыДляРасчетаВыкупныхСумм.СхемаДоговор КАК СхемаДоговор,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.Состояние КАК Состояние,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ТипРезерва КАК ТипРезерва,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ТипСуммы КАК ТипСуммы,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.НачалоПериода КАК НачалоПериода,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.КонецПериода КАК КонецПериода,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.ВидРасторжения КАК ВидРасторжения,
			уп_КоэффициентыДляРасчетаВыкупныхСумм.Коэффициент КАК Коэффициент
		ИЗ  
			РегистрСведений.уп_КоэффициентыДляРасчетаВыкупныхСумм КАК уп_КоэффициентыДляРасчетаВыкупныхСумм
		ГДЕ
			уп_КоэффициентыДляРасчетаВыкупныхСумм.СхемаДоговор ССЫЛКА Справочник.уп_ПенсионныеСхемы	
			И уп_КоэффициентыДляРасчетаВыкупныхСумм.ВидРасторжения = ЗНАЧЕНИЕ(Перечисление.уп_ВидыРасторжения.Досрочное)
			И уп_КоэффициентыДляРасчетаВыкупныхСумм.ВидРасторжения >= 1) 													КАК БудущееСхемаКоэфДляРасчетаВыкупныхСумм
	ПО ВТ_Суммы_ПР_дляВС.ПриоритетРасчетаВС = 23
		И ВТ_Суммы_ПР_дляВС.Схема = БудущееСхемаКоэфДляРасчетаВыкупныхСумм.СхемаДоговор
		И ВТ_Суммы_ПР_дляВС.СостояниеДляРасчета = БудущееСхемаКоэфДляРасчетаВыкупныхСумм.Состояние
		И ВТ_Суммы_ПР_дляВС.ТипРезерва = БудущееСхемаКоэфДляРасчетаВыкупныхСумм.ТипРезерва
		И ВТ_Суммы_ПР_дляВС.ТипСуммы = БудущееСхемаКоэфДляРасчетаВыкупныхСумм.ТипСуммы
		И (БудущееСхемаКоэфДляРасчетаВыкупныхСумм.НачалоПериода > ВТ_Суммы_ПР_дляВС.КоличествоЛет
			ИЛИ БудущееСхемаКоэфДляРасчетаВыкупныхСумм.КонецПериода > ВТ_Суммы_ПР_дляВС.КоличествоЛет)