-- Node ID: 244
-- Name: Часть_2
-- Type: sub_query
-- Parent: Подзапрос
-- OwnInTables: ВТ_ДВИЖЕНИЯПОРЕГИСТРАТОРАМ, ДОКУМЕНТ.УП_ЗАКРЫТИЕДОГОВОРАВПОЛЬЗУТРЕТЬИХЛИЦ.РАСПРЕДЕЛЕНИЕ

ВЫБРАТЬ
		ВТ_ДвиженияПоРегистраторам.НомерСчета,
		ВТ_ДвиженияПоРегистраторам.Регистратор,
		-(Распределение.СуммаСтраховая + Распределение.СуммаДоговора + Распределение.СуммаВкладчика)
	ИЗ
		ВТ_ДвиженияПоРегистраторам КАК ВТ_ДвиженияПоРегистраторам
			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уп_ЗакрытиеДоговораВПользуТретьихЛиц.Распределение КАК Распределение
			ПО ВТ_ДвиженияПоРегистраторам.НомерСчета = Распределение.НомерСтроки
				И ВТ_ДвиженияПоРегистраторам.Регистратор = Распределение.Ссылка
	ГДЕ
		ВТ_ДвиженияПоРегистраторам.СуммаРасход > 0
		И ВТ_ДвиженияПоРегистраторам.ТипДокумента = "уп_ЗакрытиеСчетов") КАК Подзапрос