-- Node ID: 243
-- Name: Часть_1
-- Type: sub_query
-- Parent: Подзапрос
-- OwnInTables: ВТ_ДВИЖЕНИЯПОРЕГИСТРАТОРАМ.РЕГИСТРАТОР, -, ВТ_ДВИЖЕНИЯПОРЕГИСТРАТОРАМ, ДОКУМЕНТ.УП_ЗАКРЫТИЕСЧЕТОВ.РАСПРЕДЕЛЕНИЕ

(ВЫБРАТЬ
		ВТ_ДвиженияПоРегистраторам.НомерСчета КАК НомерСчета,
		ВТ_ДвиженияПоРегистраторам.Регистратор КАК Регистратор,
		-(Распределение.СуммаСтраховая + Распределение.СуммаДоговора + Распределение.СуммаВкладчика) КАК Сумма
	ИЗ
		ВТ_ДвиженияПоРегистраторам КАК ВТ_ДвиженияПоРегистраторам
			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уп_ЗакрытиеСчетов.Распределение КАК Распределение
			ПО ВТ_ДвиженияПоРегистраторам.НомерСчета = Распределение.НомерСтроки
				И ВТ_ДвиженияПоРегистраторам.Регистратор = Распределение.Ссылка
	ГДЕ
		ВТ_ДвиженияПоРегистраторам.СуммаРасход > 0
		И ВТ_ДвиженияПоРегистраторам.ТипДокумента = "уп_ЗакрытиеСчетов"