-- Node ID: 105
-- Name: ВТ_ОстаткиТранзитныеВиды_Предв
-- Type: temp_query
-- Parent: null
-- OwnInTables: ВТ_ТРАНЗИТНЫЕВИДЫНАЧАЛОКОНЕЦ.ВИДОБЯЗАТЕЛЬСТВ, ВТ_ТРАНЗИТНЫЕВИДЫНАЧАЛОКОНЕЦ.ДАТАОПРЕДЕЛЕНИЯОБЯЗАТЕЛЬСТВ, ВТ_ТРАНЗИТНЫЕВИДЫНАЧАЛОКОНЕЦ.ДАТАОКОНЧАНИЯОБЯЗАТЕЛЬСТВ, ВЫБОР, ISNULL, ВТ_СУММЫ_ПР_ТРАНЗИТНЫЕВИДЫ.ОСТАТОКВХ, ВТ_СУММЫ_ПР_ТРАНЗИТНЫЕВИДЫ.ОСТАТОКИСХ, ВТ_СУММЫ_ПР_ТРАНЗИТНЫЕВИДЫ.ВЗНОСЫ, ВТ_СУММЫ_ПР_ТРАНЗИТНЫЕВИДЫ.ИНВЕСТИЦИОННЫЙДОХОД, ВТ_СУММЫ_ПР_ТРАНЗИТНЫЕВИДЫ.ЗАДОЛЖЕННОСТЬПЕНСИИ, ВТ_СУММЫ_ПР_ТРАНЗИТНЫЕВИДЫ.ИНВЕСТДОХОДКФИКСАЦИИ, ВТ_ВЫПЛАТЫТРАНЗИТНЫЕВИДЫ.ПЕНСИЯ, ВТ_ВЫПЛАТЫТРАНЗИТНЫЕВИДЫ.ВЫКУПНАЯСУММА, ВТ_ВЫПЛАТЫТРАНЗИТНЫЕВИДЫ.ВЫПЛАТАПРАВОПРЕЕМНИКАМ, ВТ_ВЫПЛАТЫТРАНЗИТНЫЕВИДЫ.ОБЯЗАТЕЛЬСТВАПЕРЕДНАСЛЕДНИКАМИ, ВТ_ПЕРЕВОДЫТРАНЗИТНЫЕВИДЫ.ПЕРЕВОД, ВТ_ПЕРЕВОДЫТРАНЗИТНЫЕВИДЫ.ПЕРЕВОДВРЕЗЕРВЫ, ВТ_ТРАНЗИТНЫЕВИДЫНАЧАЛОКОНЕЦ, ВТ_СУММЫ_ПР_ТРАНЗИТНЫЕВИДЫ, ВТ_ВЫПЛАТЫТРАНЗИТНЫЕВИДЫ, ВТ_ПЕРЕВОДЫТРАНЗИТНЫЕВИДЫ

ВЫБРАТЬ
	ВТ_ТранзитныеВидыНачалоКонец.ПенсионныйСчет КАК ПенсионныйСчет,
	ВТ_ТранзитныеВидыНачалоКонец.ВидОбязательств КАК ВидОбязательств,
	ВТ_ТранзитныеВидыНачалоКонец.ДатаОпределенияОбязательств КАК ДатаОпределенияОбязательств,
	ВТ_ТранзитныеВидыНачалоКонец.ДатаОкончанияОбязательств КАК ДатаОкончанияОбязательств, 
	ВЫБОР
		КОГДА ВТ_ТранзитныеВидыНачалоКонец.ДатаОпределенияОбязательств <= &НачалоПериода
			ТОГДА ISNULL(ВТ_Суммы_ПР_ТранзитныеВиды.ОстатокВх, 0)
		ИНАЧЕ 0
	КОНЕЦ КАК НачальныйОстаток20,
	ISNULL(ВТ_Суммы_ПР_ТранзитныеВиды.Взносы, 0) КАК Взносы26,
	ISNULL(ВТ_Суммы_ПР_ТранзитныеВиды.ИнвестиционныйДоход, 0) КАК ИнвестиционныйДоход27,
	ISNULL(ВТ_ПереводыТранзитныеВиды.Перевод, 0) КАК Перевод28,
	ISNULL(ВТ_ПереводыТранзитныеВиды.ПереводВРезервы, 0) КАК ПереводВРезервы28а,
	ISNULL(ВТ_ВыплатыТранзитныеВиды.Пенсия, 0) КАК Пенсия30,
	ISNULL(ВТ_ВыплатыТранзитныеВиды.ВыкупнаяСумма, 0) КАК ВыкупнаяСумма31,
	ISNULL(ВТ_ВыплатыТранзитныеВиды.ВыплатаПравопреемникам, 0) КАК ВыплатаПравопреемникам32,
	ВЫБОР
		КОГДА ВТ_ТранзитныеВидыНачалоКонец.ДатаОкончанияОбязательств ЕСТЬ NULL
			ТОГДА ISNULL(ВТ_Суммы_ПР_ТранзитныеВиды.ОстатокИсх, 0)
		ИНАЧЕ 0
	КОНЕЦ КАК КонечныйОстаток33,	
	ВТ_Суммы_ПР_ТранзитныеВиды.ОстатокВх КАК ОстатокВх,
	ВТ_Суммы_ПР_ТранзитныеВиды.ОстатокИсх КАК ОстатокИсх,
	ВТ_Суммы_ПР_ТранзитныеВиды.Взносы КАК Взносы,
	ВТ_Суммы_ПР_ТранзитныеВиды.ИнвестиционныйДоход КАК ИнвестиционныйДоход,
	ВТ_Суммы_ПР_ТранзитныеВиды.ЗадолженностьПенсии КАК ЗадолженностьПенсии,
	ВТ_Суммы_ПР_ТранзитныеВиды.ИнвестДоходКФиксации КАК ИнвестДоходКФиксации,
	ВТ_ВыплатыТранзитныеВиды.Пенсия КАК Пенсия,
	ВТ_ВыплатыТранзитныеВиды.ВыкупнаяСумма КАК ВыкупнаяСумма,
	ВТ_ВыплатыТранзитныеВиды.ВыплатаПравопреемникам КАК ВыплатаПравопреемникам,
	ВТ_ВыплатыТранзитныеВиды.ОбязательстваПередНаследниками КАК ОбязательстваПередНаследниками,
	ВТ_ПереводыТранзитныеВиды.Перевод КАК Перевод,
	ВТ_ПереводыТранзитныеВиды.ПереводВРезервы КАК ПереводВРезервы
ПОМЕСТИТЬ ВТ_ОстаткиТранзитныеВиды_Предв
ИЗ
	ВТ_ТранзитныеВидыНачалоКонец КАК ВТ_ТранзитныеВидыНачалоКонец
		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Суммы_ПР_ТранзитныеВиды КАК ВТ_Суммы_ПР_ТранзитныеВиды
		ПО (ВТ_ТранзитныеВидыНачалоКонец.ПенсионныйСчет = ВТ_Суммы_ПР_ТранзитныеВиды.ПенсионныйСчет
				И ВТ_ТранзитныеВидыНачалоКонец.ВидОбязательств = ВТ_Суммы_ПР_ТранзитныеВиды.ВидОбязательств
				И ВТ_ТранзитныеВидыНачалоКонец.ДатаОпределенияОбязательств = ВТ_Суммы_ПР_ТранзитныеВиды.ДатаОпределенияОбязательств)
		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыплатыТранзитныеВиды КАК ВТ_ВыплатыТранзитныеВиды
		ПО (ВТ_ТранзитныеВидыНачалоКонец.ПенсионныйСчет = ВТ_ВыплатыТранзитныеВиды.ПенсионныйСчет
				И ВТ_ТранзитныеВидыНачалоКонец.ВидОбязательств = ВТ_ВыплатыТранзитныеВиды.ВидОбязательств
				И ВТ_ТранзитныеВидыНачалоКонец.ДатаОпределенияОбязательств = ВТ_ВыплатыТранзитныеВиды.ДатаОпределенияОбязательств)
		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПереводыТранзитныеВиды КАК ВТ_ПереводыТранзитныеВиды
		ПО (ВТ_ТранзитныеВидыНачалоКонец.ПенсионныйСчет = ВТ_ПереводыТранзитныеВиды.ПенсионныйСчет
				И ВТ_ТранзитныеВидыНачалоКонец.ВидОбязательств = ВТ_ПереводыТранзитныеВиды.ВидОбязательств
				И ВТ_ТранзитныеВидыНачалоКонец.ДатаОпределенияОбязательств = ВТ_ПереводыТранзитныеВиды.ДатаОпределенияОбязательств)